[
    {
        "id": 1,
        "name": "Tarte aux pommes, miel et amandes",
        "description": "Préchauffer le four à 210°C.Granir un moule à tarte avec la pâte feuilletée. Couper les pommes en lamelles moyennes et les disposer sur la pâte. Mettre au four une vingtaine de minutes. Dans une casserole, faire fondre le beurre à feu doux. Ajouter le miel, le sucre et les amandes. Napper le dessus de la tarte avec l'appareil encore chaud, et remettre au four quelques minutes pour faire dorer le tout.",
        "image": "https://assets.afcdn.com/recipe/20160405/56983_w768h583c1cx1020cy1811cxb2000cyb3000.webp",
        "cooking_time": 40,
        "ingredients": [
            {
                "name": "Pâte feuilletée",
                "quantity": "250g"
            },
            {
                "name": "Pommes",
                "quantity": "6"
            },
            {
                "name": "Miel",
                "quantity": "2c.à.s"
            },
            {
                "name": "Sucre",
                "quantity": "100g"
            },
            {
                "name": "Beurre",
                "quantity": "70g"
            },
            {
                "name": "Amandes éffilées",
                "quantity": "100g"
            }
        ]
    },
    {
        "id": 2,
        "name": "Gratin dauphinois",
        "description": "Eplucher, laver et couper les pommes de terre en rondelles fines. Hacher l'ail très finement. Porter à ébullition dans une casserole le lait, l'ail, le sel, le poivre et la muscade puis y plonger les pommes de terre et laisser cuire 10 à 15 min, selon leur fermeté. Préchauffer le four à 180°C (thermostat 6) et beurrer un plat à gratin. Placer les pommes de terre égouttées dans le plat. Les recouvrir de crème, puis disposer des petites noix de beurre sur le dessus. Enfourner pour 50 min à 1 heure de cuisson.",
        "image": "https://assets.afcdn.com/recipe/20201217/116564_w1200h801c1cx1059cy707cxb2119cyb1415.webp",
        "cooking_time": 90,
        "ingredients": [
            {
                "name": "Pommes de terre",
                "quantity": "1,5kg"
            },
            {
                "name": "Gousses d'ail",
                "quantity": "2"
            },
            {
                "name": "Lait",
                "quantity": "1L"
            },
            {
                "name": "Muscade",
                "quantity": "1g"
            },
            {
                "name": "Crème",
                "quantity": "30cl"
            },
            {
                "name": "Beurre",
                "quantity": "100g"
            }
        ]
    },
    {
        "id": 3,
        "name": "Lasagnes à la bolognaise",
        "description": "Faire revenir gousses hachées d'ail et les oignons émincés dans un peu d'huile d'olive. Ajouter la carotte et la branche de céleri hachée puis la viande et faire revenir le tout. Au bout de quelques minutes, ajouter le vin rouge. Laisser cuire jusqu'à évaporation. Ajouter la purée de tomates, l'eau et les herbes. Saler, poivrer, puis laisser mijoter à feu doux 45 minutes. Préparer la béchamel : faire fondre le beurre. Hors du feu, ajouter la farine d'un coup. Remettre sur le feu et remuer avec un fouet jusqu'à l'obtention d'un mélange bien lisse. Ajouter le lait peu à peu. Remuer sans cesse, jusqu'à ce que le mélange s'épaississe. Ensuite, parfumer avec la muscade, saler, poivrer. Laisser cuire environ 5 minutes, à feu très doux, en remuant. Réserver. Préchauffer le four à 200°C (thermostat 6-7). Huiler le plat à lasagnes. Poser une fine couche de béchamel puis des feuilles de lasagnes, de la bolognaise, de la béchamel et du parmesan. Répéter l'opération 3 fois de suite. Sur la dernière couche de lasagnes, ne mettre que de la béchamel et recouvrir de fromage râpé. Parsemer quelques noisettes de beurre. Enfourner pour environ 25 minutes de cuisson.",
        "image": "https://assets.afcdn.com/recipe/20200408/109520_w1200h1800c1cx1866cy2800cxb3732cyb5600.webp",
        "cooking_time": 25,
        "ingredients": [
            {
                "name": "Farine",
                "quantity": "100g"
            },
            {
                "name": "Lasagnes",
                "quantity": "1 paquet"
            },
            {
                "name": "Lait",
                "quantity": "1L"
            },
            {
                "name": "Carotte",
                "quantity": "1"
            },
            {
                "name": "Purée de tomate",
                "quantity": "800g"
            },
            {
                "name": "Beurre",
                "quantity": "100g"
            },
            {
                "name": "Parmesan",
                "quantity": "125g"
            },
            {
                "name": "Oignons jaunes",
                "quantity": "3"
            },
            {
                "name": "Boeuf haché",
                "quantity": "600g"
            },
            {
                "name": "Feuilles de laurier",
                "quantity": "2"
            },
            {
                "name": "Fromage râpé",
                "quantity": "70g"
            },
            {
                "name": "Céleri branche",
                "quantity": "1"
            }
        ]
    },
    {
        "id": 4,
        "name": "Quenelles sauce tomate",
        "description": "Préchauffer le four à 150°C (thermostat 5). Beurrer le plat. Disposer les quenelles sur 2 rangées, en séparant chaque quenelle avec 2 olives vertes, 1 olive noire et 2 champignons (bien respecter la disposition pour que les quenelles en cuisant est la place de gonflées). Sauce : dans une grande casserole, faire fondre le beurre (attention, il ne doit pas cuire). Laisser refroidir, puis ajouter la farine et les œufs. Mélanger au fouet (il ne doit pas y avoir de grumeaux). Ajouter le coulis de tomate et la crème fraîche. Diluer le tout avec le vin blanc en continuant de remuer. Verser doucement la sauce sur les quenelles et enfourner. Laisser cuire 50 min à 150°C.",
        "image": "https://assets.afcdn.com/recipe/20190920/98512_w768h583c1cx320cy300cxb640cyb600.webp",
        "cooking_time": 50,
        "ingredients": [
            {
                "name": "Champignons",
                "quantity": "1 boîte"
            },
            {
                "name": "Vin blanc",
                "quantity": "70 cL"
            },
            {
                "name": "Maïzena",
                "quantity": "2c.à.s"
            },
            {
                "name": "Quenelles",
                "quantity": "24"
            },
            {
                "name": "Olives vertes",
                "quantity": "250g"
            },
            {
                "name": "Olives noires",
                "quantity": "125g"
            },
            {
                "name": "Crème fraîche",
                "quantity": "20cL"
            },
            {
                "name": "Beurre",
                "quantity": "50g"
            },
            {
                "name": "Coulis tomate",
                "quantity": "250g"
            },
            {
                "name": "Oeufs",
                "quantity": "2"
            }
        ]
    },
    {
        "id": 5,
        "name": "Riz au lait",
        "description": "Mettez une noix de beurre à fondre dans une casserole. Ajoutez le riz en remuant sur feu moyen pendant 3-4 mn. Versez le lait entier, puis le sucre, la pincée de sel et la gousse de vanille fendue. Remuez et baissez le feu. Il faut que le lait chauffe très doucement. Laissez cuire en surveillant et en remuant souvent pour éviter que le riz ne colle au fond. Après 35 mn, vérifiez la cuison et la consistance. Il faut que le lait soit crémeux et que le riz soit bien cuit. Retirez la gousse de vanille et rectifiez le goût pour le sucre. Verser dans des petits ramequins individuels et laisser refroidir. ",
        "image": "https://assets.afcdn.com/recipe/20130924/28980_w1200h824c1cx2670cy1833.webp",
        "cooking_time": 35,
        "ingredients": [
            {
                "name": "Sucre",
                "quantity": "4 à 5 cuillières"
            },
            {
                "name": "Gousse de vanille",
                "quantity": "1"
            },
            {
                "name": "Riz",
                "quantity": "1 tasse"
            },
            {
                "name": "Lait",
                "quantity": "90cL"
            }
        ]
    },
    {
        "id": 6,
        "name": "Gratin de macaronis",
        "description": "Après avoir porté de l'eau à ébullition, plongez la totalité des macaronis et les laisser cuire le temps indiqué sur le paquet de manière à ce qu'ils soient tout de même al dente. Pendant la cuisson des pâtes, faites fondre votre cube dans environ 25 cl d'eau bouillante, puis ajouter le berlingot de crème fraîche. Retirez du feu et mettre en attente. Lorsque vous égoutter les macaronis il est conseillé de les rincer à l'eau tiède ou froide. Vous les répartissez ensuite dans un plat à gratin de manière homogène, puis vous y versez votre bouillon. Veillez à ne pas faire baigner les pâtes (si c'est le cas retirez un peu de liquide). Mettre du gruyère sur le tout à votre goût. Mettre à cuire environ 15 min à chaleur tournante (180/200°C). Le gratin doit être légèrement gratiné. Si vous avez le temps laissez-le un peu de côté, quitte à le faire réchauffer au moment de passer à table (il est plus gonflé et meilleur)",
        "image": "https://assets.afcdn.com/recipe/20200220/107948_w768h583c1cx3858cy1808cxb5518cyb3840.webp",
        "cooking_time": 15,
        "ingredients": [
            {
                "name": "Cube de bouillon",
                "quantity": "1"
            },
            {
                "name": "Macaroni",
                "quantity": "500g"
            },
            {
                "name": "Crème fraîche",
                "quantity": "20cL"
            },
            {
                "name": "Emmental râpé",
                "quantity": "100g"
            }
        ]
    },
{
        "id": 7,
        "name": "Fondue au fromage de Comté",
        "description": "Frotter la gousse d'ail sur les parois et le fond de la cocotte ou de l'appareil à fondue. Détailler le fromage en petits dés et le mettre à fondre dans la cocotte avec 30 cl de vin blanc. Remuer constamment jusqu'à ce que le mélange soit bien homogène. Rajouter du vin si nécessaire. Mélanger le kirsch et la maïzena puis verser dans le fromage. Remuer et placer à table sur un réchaud. Servir avec le pain coupé en morceaux. Les convives piquent un morceau de pain sur une fourchette et le trempent dans le fromage fondu.",
        "image": "https://assets.afcdn.com/recipe/20170316/2121_w768h583c1cx1872cy2808.webp",
        "cooking_time": 30,
        "ingredients": [
            {
                "name": "Vin blanc sec (Côtes du Jura de préférence)",
                "quantity": "50cl"
            },
            {
                "name": "gousse d'ail",
                "quantity": "1"
            },
            {
                "name": "Maïzena",
                "quantity": "1 c.à.s"
            },
            {
                "name": "Comté",
                "quantity": "900g"
            },
            {
                "name": "Kirsch",
                "quantity": "4cl"
            },
            {
                "name": "Pain rassis",
                "quantity": "à volonté"
            }
        ]
    },
    {
        "id": 8,
        "name": "Ramequins fondants au chocolat",
        "description": "Faites fondre dans une casserole le chocolat et le beurre, en remuant régulièrement pour former une pâte homogène et onctueuse. Préchauffez le four à 210°C (thermostat 7). Dans un saladier, mélangez les oeufs, le sucre et la farine. Incorporez la préparation chocolatée et mélangez. Versez 1/3 de la préparation dans des ramequins individuels. Déposez deux carrés de chocolat dans chacun des 4 ramequins, puis recouvrez-les avec le reste de la préparation chocolatée. Placez les ramequins au four pendant environ 12 minutes, pas plus! Dégustez de préférence chauds ou tièdes. Miam !",
        "image": "https://assets.afcdn.com/recipe/20160610/21702_w1200h1800c1cx2135cy3776cxb4000cyb6000.webp",
        "cooking_time": 12,
        "ingredients": [
            {
                "name": "Chocolat noir",
                "quantity": "120g"
            },
            {
                "name": "Sucre",
                "quantity": "80g"
            },
            {
                "name": "Farine",
                "quantity": "1 c.à.s"
            },
            {
                "name": "Oeufs",
                "quantity": "3"
            },
            {
                "name": "Beurre doux",
                "quantity": "35g"
            }
        ]
    },
    {
        "id": 9,
        "name": "Filet mignon en crôute",
        "description": "Peler et émincer les oignons. Les faire revenir dans une sauteuse avec 20 g de beurre pendant 3 minutes environ. Les retirer de la sauteuse et les réserver. Dans la même sauteuse, faire revenir les filets mignons de chaque côté. Laisser cuire 10 minutes à feu doux. Réincorporer les oignons. Poursuivre la cuisson pendant 5 minutes. Saler, poivrer. Réserver. Dérouler les pâtes feuilletées. Déposer sur chaque pâte deux tranches de jambon et 100 g de gruyère. Saler et poivrer. Y déposer un filet sur chaque pâte garnie et napper de sauce aux oignons. Replier la pâte autour de la viande et souder les bords à l'aide du jaune d'oeuf préalablement battu et d'un pinceau alimentaire. Enfourner pour 45 minutes de cuisson à 200°C (thermostat 6-7).",
        "image": "https://assets.afcdn.com/recipe/20170615/69644_w1200h1800c1cx2000cy3000.webp",
        "cooking_time": 45,
        "ingredients": [
            {
                "name": "Pâtes feuilletées",
                "quantity": "2"
            },
            {
                "name": "Filets mignons de porc",
                "quantity": "2"
            },
            {
                "name": "Jambon blanc",
                "quantity": "4 tranche"
            },
            {
                "name": "Gruyère râpé",
                "quantity": "200g"
            },
            {
                "name": "Oignons jaunes",
                "quantity": "2"
            },
            {
                "name": "Jaunes d'oeuf",
                "quantity": "2"
            }
        ]
    },
    {
        "id": 10,
        "name": "Rôti de porc de Dijon",
        "description": "Piquer le rôti de petites gousses d'ail coupées en deux ou trois, suivant grosseur. Dans une cocotte, le faire dorer quelques minute dans du beurre sur toute les faces. Saler et poivrer. Quand il est bien coloré, le retirer de la cocotte et le badigeonner avec la moutarde forte, remettre ensuite à cuire avec les échalotes, couvrir et laisser mijoter à feu doux pendant +/- 1h30, en retournant de temps en temps. Rajouter de l'eau régulièrement, dès lors que tout le liquide est évaporé. Après ce temps, retirer le rôti et les échalotes, puis rectifier la sauce si nécessaire (avec sel et poivre), puis ajouter la crème fraîche selon votre goût. Couper le rôti en tranches, puis le servir nappé de sauce et accompagné des petites échalotes entières.",
        "image": "https://assets.afcdn.com/recipe/20210203/117771_w1200h800c1cx1060cy707cxb2121cyb1414.webp",
        "cooking_time": 60,
        "ingredients": [
            {
                "name": "Gousse d'ail",
                "quantity": "3/4"
            },
            {
                "name": "Moutarde de Dijon forte",
                "quantity": "selon vos goût"
            },
            {
                "name": "Rôti de porc",
                "quantity": "600g"
            },
            {
                "name": "Echalotes",
                "quantity": "10"
            },
            {
                "name": "Crème fraîche allégée",
                "quantity": "Assez peu"
            }    
        ]
    },
    {
        "id": 11,
        "name": "Crevettes au curry express",
        "description": "Décortiquer les crevettes. Les faire revenir très rapidement dans l'huile d'olive en les saupoudrant de curry. Ajouter la crème et mélanger le tout. Servir immédiatement avec du riz thaï.",
        "image": "https://assets.afcdn.com/recipe/20150225/32437_w1200h1678c1cx1250cy1747.webp",
        "cooking_time": 5,
        "ingredients": [
            {
                "name": "Curry",
                "quantity": "1 c.à.c"
            },
            {
                "name": "Huile d'olive",
                "quantity": "2 c.à.c"
            },
            {
                "name": "Crevette rose",
                "quantity": "300g"
            },
            {
                "name": "Crème",
                "quantity": "2 c.à.s"
            }
        ]
    },
    {
        "id": 12,
        "name": "Pâte à pizza fine",
        "description": "Verser la farine dans un grand saladier et y faire un puits. Verser la levure, le sel et le sucre dans un verre doseur. Ajouter 1/4 de litre d'eau tiède, bien mélanger. Couvrir d'un film plastique et laisser reposer environ 10 minutes (jusqu'à l'apparition d'une mousse brune bien épaisse en surface). Verser le mélange du verre doseur dans le saladier, mélanger à la main. Puis quand la pâte n'est plus collante pétrir environ 5 minutes à la main sur une surface farinée. Arroser d'un peu d'huile d'olive, puis pétrir à nouveau environ 5 minutes. Laisser reposer au moins 1 h sous un linge humide dans un endroit tiède (à côté d'un radiateur, d'une cheminée ou d'un poêle en hiver). Après repos, pétrir quelques instants puis diviser la pâte en trois boules égales (on peut en congeler). Etaler la pâte sur une surface farinée. Badigeonner la plaque d'un peu d'huile d'olive avant d'y appliquer la pâte. Cuisson 10 minutes à 220°C (thermostat 7-8).",
        "image": "https://assets.afcdn.com/recipe/20100120/39725_w768h576c1cx256cy192.webp",
        "cooking_time": 10,
        "ingredients": [
            {
                "name": "Farine",
                "quantity": "500g"
            },
            {
                "name": "Levure de boulangerie",
                "quantity": "1 sachet"
            },
            {
                "name": "Eau tiède",
                "quantity": "1/4L"
            },
            {
                "name": "Sucre",
                "quantity": "1 c.à.c"
            }
        ]
    },
    {
        "id": 13,
        "name": "Endive Jambon",
        "description": "Effeuiller les endives pour les faire cuire dans le l'eau bouillante. Quand elles sont cuites les laisser égoutter. Faire fondre dans une casserole, une noisette de beurre, y ajouter l'ail écrasé, puis ensuite, y verser la crème fraîche, saler poivrer, et y mettre le gruyère râpé en en conservant une partie pour le gratiné. Disposer dans un plat allant au four, une couche d'endive, une couche de jambon, et une couche de la préparation à la crème, renouveller cette opération et terminer en mettant le reste du gruyère râpé sur le dessus. Faire gratiner pendant à peu près 30 mn à four chaud et régalez vous.",
        "image": "https://assets.afcdn.com/recipe/20161006/1269_w1200h1800c1cx2000cy3000.webp",
        "cooking_time": 30,
        "ingredients": [
            {
                "name": "Endive",
                "quantity": "1kg"
            },
            {
                "name": "Gousses d'ail",
                "quantity": "2"
            },
            {
                "name": "Jambon",
                "quantity": "4 tranche"
            },
            {
                "name": "Gruyère râpé",
                "quantity": "1 sachet"
            },
            {
                "name": "Beurre",
                "quantity": "1 noisette"
            },
            {
                "name": "Crème fraîche liquide épaisse",
                "quantity": "1 pot"
            }
        ]
    },
    {
        "id": 14,
        "name": "Poulet curry et oignons facile",
        "description": "Mettre une grande poêle à chauffer. Couper les oignons en petits morceaux, et les faire cuire à feu assez fort. Remuer, en ajoutant du curry et du cumin. Couper les blancs de poulet en morceaux, les ajouter dans la poêle et remettre des épices; tourner. Baisser le feu, et ajouter 2 cuillères à soupe de crème. Après 5 min de cuisson, remettre 2 cuillères à soupe de crème et des épices (si nécessaire). Si le plat est fait à l'avance, remettre un peu de crème au moment de réchauffer car la sauce s'évapore. Bon appétit",
        "image": "https://assets.afcdn.com/recipe/20160405/6932_w1200h798c1cx2125cy1414.webp",
        "cooking_time": 15,
        "ingredients": [
            {
                "name": "Curry",
                "quantity": "1 c.à.c"
            },
            {
                "name": "Cumin",
                "quantity": "1 c.à.c"
            },
            {
                "name": "Piment",
                "quantity": "Selont goût"
            },
            {
                "name": "Blanc de poulet",
                "quantity": "4"
            },
            {
                "name": "Oignon jaunes",
                "quantity": "2"
            },
            {
                "name": "Crème fraîche allégée",
                "quantity": "1 pot"
            }
        ]
    },
    {
        "id": 15,
        "name": "Cailles à la moutarde et au miel",
        "description": "Faire fondre à feu doux le beurre et le miel, puis hors du feu, ajouter la moutarde le sel et le poivre. Badigeonner les cailles avec ce mélange onctueux dans un plat allant au four. Recouvrir le plat d'un papier aluminium et laisser reposer 2 heures à température ambiante ou une nuit au frigo. Allumer le four 210°C (thermostat 7). Mettre le plat couvert d'alu dans le four chaud pendant 25 min puis retirer l'alu et poursuivre la cuisson encore 25 à 30 min en arrosant souvent avec la sauce. Servir les cailles dorées accompagnées de tagliatelles au citron par exemple",
        "image": "https://assets.afcdn.com/recipe/20141105/12074_w1200h1240c1cx1250cy1292.webp",
        "cooking_time": 60,
        "ingredients": [
            {
                "name": "Miel",
                "quantity": "4 c.à.s"
            },
            {
                "name": "Cumin",
                "quantity": "2 c.à.s"
            },
            {
                "name": "Cailles",
                "quantity": "8"
            },
            {
                "name": "Beurre",
                "quantity": "50g"
            }
        ]
    },
    {
        "id": 16,
        "name": "Brochettes de poulet express aux épices",
        "description": "Couper le poulet en cubes et les tremper dans la marinade (mélanger tous les ingrédients) puis faire 4 brochettes égales. Faire cuire 10 min à la poêle en versant 2 cuillères de marinade pour la cuisson, retourner plusieurs fois. Possibilité de saupoudrer un peu plus de curry à la cuisson. Augmenter légèrement le feu pour un aspect caramélisé. Servir avec du couscous aux épices ou une simple salade verte.",
        "image": "https://assets.afcdn.com/recipe/20180209/77490_w1200h839c1cx1800cy1258cxb3600cyb2516.webp",
        "cooking_time": 10,
        "ingredients": [
            {
                "name": "Huile d'olive",
                "quantity": "1 verre"
            },
            {
                "name": "Moutarde",
                "quantity": "2 c.à.s"
            },
            {
                "name": "Curry",
                "quantity": "2 c.à.s"
            },
            {
                "name": "Cumin",
                "quantity": "1 c.à.s"
            },
            {
                "name": "Blancs de poulet",
                "quantity": "4"
            },
            {
                "name": "Miel",
                "quantity": "2 c.à.s"
            }
        ]
    },
    {
        "id": 17,
        "name": "Tartiflette",
        "description": "Faites cuire les pommes de terre avec leur peau. Épluchez-les et coupez-les en rondelles. Émincez les oignons puis faites-les revenir avec un peu de beurre. Une fois dorés, y ajouter le jambon (ou les lardons), ainsi que les pommes de terre. Laissez mijoter 15 min. Si vous utilisez du vin blanc, c'est le moment de l'ajouter. Salez un peu, poivrez, laissez les pommes de terre s'imprégner du vin blanc quelques minutes avant de transférer le tout dans un plat à gratin. Grattez au couteau les reblochons, coupez-les en 2 dans le sens de l'épaisseur et posez les sur les pommes de terre. Faites cuire à four chaud (220°C) pendant 20 à 30 min. Servez avec une salade verte, voire quelques tomates, juste assaisonnées d'un peu de vinaigre d'échalote.",
        "image": "https://assets.afcdn.com/recipe/20130628/2502_w1200h1800c1cx1250cy1875.webp",
        "cooking_time": 20,
        "ingredients": [
            {
                "name": "Pomme de terre",
                "quantity": "1 kg"
            },
            {
                "name": "Reblochon",
                "quantity": "2"
            },
            {
                "name": "Jambon fumé",
                "quantity": "1 tranche"
            },
            {
                "name": "Oignon",
                "quantity": "500g"
            }
        ]
    },
    {
        "id": 18,
        "name": "Roulés à la saucisse",
        "description": "Une pâte feuilletée découpée et des saucisses de strasbourg coupées et roulées dedans. Mettre 10 sec au four.",
        "image": "https://assets.afcdn.com/recipe/20181017/82839_w96h96c1cx1944cy2592cxb3888cyb5184.webp",
        "cooking_time": 0.1,
        "ingredients": [
            {
                "name": "Saucisses",
                "quantity": "6"
            },
            {
                "name": "Pâte feuilletée",
                "quantity": "1"
            }
        ]
    }
]